Конфигурация/Reports/ЖурналыВходящихИсходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ЖурналыВходящихИсходящихДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРегистрационногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатусыЛицензий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЛицензий</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лицензия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лицензии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозван</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДействует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Reports/ЖурналыВходящихИсходящихДокументов/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	ДатаНачала = ЭтотОбъект.ПериодОтчета.ДатаНачала;
	ДатаОкончания = ?(ЗначениеЗаполнено(ЭтотОбъект.ПериодОтчета.ДатаОкончания), ЭтотОбъект.ПериодОтчета.ДатаОкончания, '39991231');
	
	Настройки = КомпоновщикНастроек.Настройки;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 	ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", 	ДатаНачала);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", 	ДатаОкончания);
	
	КлючТекущегоВарианта = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючТекущегоВарианта;
	
	ЮрЛицоОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо");
	НаименованиеОрганизации = ПолучитьНаименованиеОрганизации(ЮрЛицоОрганизации, ДатаОкончания);
	
	ПредставлениеПериода = "с " + Формат(ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
	
	Если КлючТекущегоВарианта = "ЖурналЖалобИОбращений" Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заголовок", "Журнал регистрации обращений, жалоб, заявлений " + НаименованиеОрганизации);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Лицензия", ПолучитьПредставлениеОтбора(ЮрЛицоОрганизации, ДатаОкончания));
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПредставлениеПериода", "Период: " + ПредставлениеПериода);
	Иначе 
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЗаголовокОрганизация", НаименованиеОрганизации);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПредставлениеПериода", "период " + ПредставлениеПериода);
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьНаименованиеОрганизации(Организация, ДатаОкончания)

	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|			&ДатаОкончания,
		|			ЮрФизЛицо = &Организация
		|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КраткоеНаименованиеПоУставу;
	КонецЕсли; 

КонецФункции
 
Функция ПолучитьПредставлениеОтбора(Организация, ДатаОкончания)

	ВидыЛицензий = Новый Массив;
	НайтиОтборПоЛицензии(КомпоновщикНастроек.ПолучитьНастройки().Отбор, ВидыЛицензий);
	
	Если ВидыЛицензий.Количество() = 0 Тогда
	
		ВидыЛицензий.Добавить(Справочники.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами);
		ВидыЛицензий.Добавить(Справочники.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ);
		ВидыЛицензий.Добавить(Неопределено);
	
	КонецЕсли; 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лицензии.Ссылка КАК Ссылка,
		|	Лицензии.Номер КАК Номер,
		|	Лицензии.ДатаВыдачи КАК ДатаВыдачи,
		|	Лицензии.ВидДеятельности КАК ВидДеятельности
		|ИЗ
		|	Справочник.Лицензии КАК Лицензии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(&ДатаОкончания, ) КАК СтатусыЛицензийСрезПоследних
		|		ПО (СтатусыЛицензийСрезПоследних.Лицензия = Лицензии.Ссылка)
		|ГДЕ
		|	Лицензии.ЮрФизЛицо = &Организация
		|	И Лицензии.ВидДеятельности В(&ВидДеятельности)
		|	И СтатусыЛицензийСрезПоследних.Статус = Значение(Перечисление.СтатусыДокументов.Действует)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВыдачи,
		|	Номер";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаОкончания", 		ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ВидДеятельности", 	ВидыЛицензий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивЛицензий = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивЛицензий.Добавить(Строка(Выборка.ВидДеятельности) + " №" + Выборка.Номер + " от " + Формат(Выборка.ДатаВыдачи, "ДФ=dd.MM.yyyy"));
	КонецЦикла; 
	Если ВидыЛицензий.Найти(Неопределено) <> Неопределено Тогда
		МассивЛицензий.Добавить("По собственной деятельности УК");
	КонецЕсли; 
	
	ПредставлениеОтбора = ?(ВидыЛицензий.Количество() = 1, "Лицензия: ", "Лицензии: ") + СтрСоединить(МассивЛицензий, ";" + Символы.ПС);
	
	Возврат ПредставлениеОтбора;

КонецФункции
 
Процедура НайтиОтборПоЛицензии(Отбор, ВидыЛицензий)

	Для каждого ЭлементОтбора Из Отбор.Элементы Цикл
	
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			НайтиОтборПоЛицензии(ЭлементОтбора, ВидыЛицензий);
		Иначе
			Если ЭлементОтбора.Использование И ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("Булево") 
				И ((ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно И ЭлементОтбора.ПравоеЗначение)
					Или (ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно И Не ЭлементОтбора.ПравоеЗначение)) Тогда
				
				Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВходящиеДокументы.ПоЛицензииДУ") Тогда
					ВидыЛицензий.Добавить(Справочники.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами);
				ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВходящиеДокументы.ПоЛицензииУКПИФ") Тогда
					ВидыЛицензий.Добавить(Справочники.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюИнвестиционнымиФондамиПИФиНПФ);
				ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВходящиеДокументы.ПоСобственнойДеятельностиУК") Тогда
					ВидыЛицензий.Добавить(Неопределено);
				КонецЕсли; 
			
			КонецЕсли; 
		КонецЕсли; 
	
	КонецЦикла; 

КонецПроцедуры
